{"translation-revision-date":"2023-03-26 06:31:54+0000","generator":"GlotPress\/4.0.0-alpha.4","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=2; plural=n > 1;","lang":"fr"},"Control set utilities allow you to copy and import visibility settings. This functionality is useful when advanced setting configurations need to be applied to multiple blocks.":["Les outils de gestion des ensembles de contrôles vous permettent de copier et d’importer des réglages. Cette fonctionnalité est utile lorsque des configurations de paramètres avancés doivent être appliquées à plusieurs blocs."],"Utilities":["Outils"],"Visibility Presets allow you to configure visibility controls globally and then apply them to individual blocks.":["Les préréglages de visibilité permettent de configurer les contrôles globalement avant de les appliquer individuellement aux blocs."],"Enable the Visibility Presets control.":["Activer le contrôle de préréglages de visibilité."],"The URL Path control allows you to conditionally display a block based on the URL of the page that the block is on.":["Le contrôle Chemin d’URL vous permet d’afficher conditionnellement un bloc en fonction de l’URL de la page sur laquelle le bloc se trouve."],"Enable the URL Path control.":["Activer le contrôle Chemin d’URL."],"The Referral Source control allows you to conditionally display blocks based on the domain or URL from which visitors arrive at your site.":["Le contrôle Source de traffic vous permet d’afficher conditionnellement des blocs en fonction de l’URL de provenance des internautes qui arrivent sur votre site."],"Enable the Referral Source control.":["Activer le contrôle Source de traffic."],"The Metadata control allows you to conditionally display a block based on post or user metadata. Metadata is often referred to as Custom Fields. If you are already using the Advanced Custom Fields plugin, use the ACF control over the Metadata control.":["Le contrôle Métadonnée vous permet d’afficher conditionnellement un bloc en fonction d’une métadonnée liée à une publication ou à un compte. Les métadonnées sont souvent appelées « champs personnalisés ». Si vous utilisez déjà l’extension Advanced Custom Fields, utilisez plutôt le contrôle ACF plutôt que le contrôle Métadonnée."],"Enable the Metadata control.":["Activer le contrôle Métadonnées."],"Metadata (Custom Fields)":["Métadonnée (champs personnalisés)"],"The Location control allows you to conditionally display blocks based on where the block is located on your website. This includes page and post types, taxonomies, and more.":["Le contrôle Emplacement vous permet d’afficher conditionnellement un bloc en fonction de l’endroit où se trouve le bloc sur votre site. Ce qui inclue les pages et articles, les taxonomies, et plus encore."],"Enable the Location control.":["Activer le contrôle Emplacement."],"The Time of Day adds functionality to the main Date & Time control. It allows you to conditionally display blocks at specific time intervals on each day of a given schedule.":["Le contrôle Heure du jour ajoute une fonctionnalité au contrôle principal Date & heure. Il vous permet d’afficher conditionnellement des blocs sur des intervalles de temps définis les jours que vous aurez planifiés."],"The Day of Week control adds functionality to the main Date & Time control. It allows you to conditionally display blocks based on specific days of the week within a given schedule.":["Le contrôle Jour de la semaine ajoute une fonctionnalité au contrôle principal Date & heure. Il vous permet d’afficher conditionnellement des blocs en fonction des jours de la semaine que vous aurez planifiés."],"Enable the Time of Day control.":["Activer le contrôle Heure du jour."],"Enable the Day of Week control.":["Activer le contrôle Jour de la semaine."],"The Cookie control allows you to conditionally display a block based on HTML cookies.":["Le contrôle Cookie vous permet d’afficher conditionnellement un bloc en fonction des cookies HTML."],"Enable the Cookie control.":["Activer le contrôle Cookie."],"The Browser & Device control allows you to conditionally display a block based on the device or web browser the current user is using to visit your website.":["Le contrôle Navigateur & appareil vous permet d’afficher conditionnellement un bloc en fonction de l’appareil ou du navigateur web utilisé par l’internaute lors de sa visite sur votre site."],"Enable the Browser & Device control.":["Activer le contrôle Navigateur & Appareil."],"Browser & Device (User Agent)":["Navigateur & Appareil (Agent utilisateur)"],"\"Local\" refers to the visibility controls available on each block. When disabled, only Visibility Presets and the Hide Block control will be available. Presets are then used to manage all other enabled controls.":["« Locaux » fait référence aux contrôles de visibilité disponibles sur chaque bloc. Lorsque cette option est désactivée, seuls les préréglages de visibilité et la commande « Masquer le bloc » seront disponibles. Les préréglages sont ensuite utilisés pour gérer tous les autres contrôles activés."],"Enable local visibility controls.":["Activer les contrôles de visibilité locaux."],"Visibility Presets":["Préréglages de visibilité"],"URL Path":["Chemin d’URL"],"Referral Source":["Source de traffic"],"Metadata":["Métadonnée"],"Location":["Emplacement"],"Cookie":["Cookie"],"Browser & Device":["Navigateur & appareil"],"The settings below allow you to configure general functionality for the Block Visibility plugin.":["Les réglages ci-dessous vous permettent de configurer les fonctionnalités générales de l’extension Block Visibility."],"Some blocks do not have visibility controls enabled by default. These include child blocks and blocks that may exist in WordPress but cannot be added directly to the Editor. You will not need Full Control Mode most of the time, but it's here in case you do.":["Certains blocs n’ont pas de contrôles de visibilité activés par défaut. Cela inclut les blocs enfants et des blocs qui existent dans WordPress mais ne peuvent pas être ajoutés directement via l’éditeur. Vous n’aurez pas besoin du mode « Contrôle total » la plupart du temps, mais il est là au cas où."],"By default, all users that can edit blocks will be able to use the visibility controls provided by Block Visibility.":["Par défaut, tous les comptes pouvant modifier des blocs pourront utiliser les contrôles de visibilité fournis par Block Visibility."],"Enable utilities for managing visibility settings (copy, import, etc.)":["Activer les outils pour gérer les réglages (copie, importation, etc.)"],"By default, help notices and popovers display in the Editor providing additional information about how to use Block Visibility. Disable for a more simplified interface.":["Par défaut, des notifications d’aide et des fenêtres contextuelles s’affichent sous l’éditeur, fournissant ainsi des informations supplémentaires sur l’utilisation de Block Visibility. Désactiver pour une interface plus simplifiée."],"Enable help notices and popovers in the Editor.":["Activer les notifications d’aide sous l’Éditeur."],"Help Notices & Popovers":["Notifications d’aide"],"Some visibility controls (currently just the Hide Block control) can be made available in the toolbar of each block.":["Certains contrôles de visibilité (actuellement uniquement le contrôle « Masquer le bloc ») peuvent être accessibles dans la barre d’outils de chaque bloc."],"Combining contextual indicators with reduced block opacity can assist users in quickly determining which blocks have active visibility controls.":["Les indicateurs contextuels associés à une opacité de bloc réduite peuvent aider les utilisateurs et utilisatrices à déterminer rapidement quels blocs ont des contrôles de visibilité actifs."],"Contextual indicators assist users in quickly determining which blocks have active visibility controls.":["Des indicateurs contextuels aident les utilisatrices et utilisateurs à déterminer rapidement quels blocs ont des contrôles de visibilité actifs."],"Settings that impact the Editor, such as contextual indicators for when a block has visibility controls, as well as additional toolbar options.":["Réglages ayant un impact sur l’éditeur, tels que les indicateurs contextuels lorsqu’un bloc a des contrôles de visibilité, ou des options de barre d’outils supplémentaires."],"Editor":["Éditeur"],"If you are looking for a block and do not see it listed, you may need to enable Full Control Mode on the General Settings tab.":["Si vous recherchez un bloc et le ne trouvez pas, vous avez probablement besoin d’activer le mode « Contrôle total » dans l’onglet « Réglages généraux »."],"Only some block types may need visibility controls. The Block Manager allows you to restrict visibility controls to specific block types.":["Seuls certains types de blocs peuvent nécessiter des contrôles de visibilité. Le gestionnaire de blocs vous permet de limiter les contrôles de visibilité à des types de blocs spécifiques."],"Some blocks may appear in the Block Manager as uncategorized even though they have an assigned category in the Editor. This is due to how the block is registered in WordPress.":["Certains blocs peuvent apparaître dans le gestionnaire de blocs comme non classés même s’ils ont une catégorie attribuée dans l’éditeur. Cela est dû à la façon dont le bloc est enregistré dans WordPress."],"When a visibility control is disabled, blocks that rely on the disabled control will become visible again unless other enabled controls hide them.":["Lorsqu’un contrôle de visibilité est désactivé, les blocs qui dépendent de ce contrôle redeviennent visibles à moins que d’autres contrôles activés ne les masquent."],"Reset failed. Try again or get in touch with support.":["La réinitialisation a échoué. Réessayez ou contactez le support."],"Update failed. Try again or get in touch with support.":["La mise à jour a échoué. Réessayez ou contactez le support."],"The WP Fusion control allows you to conditionally display blocks based on WP Fusion tags.":["Le contrôle WP Fusion vous permet d’afficher conditionnellement les blocs en fonction de balises WP Fusion."],"The Advanced Custom Fields (ACF) control allows you to conditionally display blocks, including ACF blocks, based on ACF fields.":["Le contrôle Advanced Custom Fields (ACF) vous permet d’afficher conditionnellement les blocs, y compris les blocs ACF, en fonction de champs ACF."],"The User Role control allows you to conditionally display blocks based on whether a user is logged-in, logged-out, and more.":["Le contrôle « Rôle du compte » vous permet d’afficher conditionnellement des blocs selon qu’un compte est connecté, déconnecté, etc."],"The Date & Time control allows you to conditionally display blocks based on time and date settings, which includes the ability to schedule blocks.":["Le contrôle « Date & heure » vous permet d’afficher conditionnellement des blocs en fonction de réglages d’heure et de date, ce qui inclut la possibilité de planifier l’affichage de blocs."],"The Hide Block control allows you to hide blocks easily on your website's front end. This control overrides all other controls when enabled on a block.":["Le contrôle « Masquer le bloc » vous permet de masquer facilement les blocs sur l’interface publique de votre site. Ce contrôle remplace tous les autres contrôles lorsqu’il est activé sur un bloc."],"Default controls are automatically displayed in the Visibility panel when editing a block in the Editor. Defaults can be helpful if you frequently use the same few controls.":["Les contrôles par défaut sont automatiquement affichés dans le panneau « Visibilité » lors de la modification d’un bloc dans l’éditeur. Les valeurs par défaut peuvent être utiles si vous utilisez fréquemment les mêmes contrôles."],"Reduce block opacity when visibility controls are applied.":["Réduire l’opacité du bloc lorsque des options de visibilité sont appliquées."],"Contextual Block Opacity":["Opacité contextuelle du bloc"],"Block Opacity":["Opacité du bloc"],"This functionality allows you to create user-based rule sets, which provide extensive configuration options and greater flexibility.":["Cette fonctionnalité vous permet de créer des ensembles de règles basés sur les comptes, offrant ainsi des options de configuration étendues et une plus grande flexibilité."],"Enable advanced user role restrictions (User rule sets)":["Activer les restrictions avancées sur les rôles des comptes (ensembles de règles)"],"General":["Général"],"Reset All":["Tout réinitialiser"],"Resetting will restore all configured settings on the current tab to their default values. To restore all plugin settings, choose Reset All.":["La réinitialisation restaurera tous les réglages configurés sur l’onglet actif à leurs valeurs par défaut. Pour restaurer tous les réglages de l’extension, choisissez Tout réinitialiser."],"Reset Settings":["Réinitialiser les réglages"],"Submit a Review":["Laisser un avis"],"If you are enjoying Block Visibility and find it useful, please consider leaving a ★★★★★ review on WordPress.org. Your feedback is greatly appreciated and helps others discover the plugin.":["Si vous appréciez Block Visibility et que vous le trouvez utile, pensez à laisser un avis 5 étoiles ★★★★★ sur WordPress.org. Vos retours sont grandement appréciés et aident les autres à découvrir l’extension."],"Share Your Feedback":["Donnez votre avis"],"View Knowledge Base":["Voir la base de connaissances"],"Detailed documentation is also available on the plugin website.":["Une documentation détaillée est également disponible sur le site de l’extension."],"Support Forum":["Forum de support"],"Whether you need help or have a new feature request, please create a topic in the support forum on WordPress.org.":["Si vous ayez besoin d’aide ou si vous avez besoin d’une nouvelle fonctionnalité, veuillez créer un sujet dans le forum de support sur WordPress.org."],"Need Support?":["Besoin d’aide ?"],"Indicator color":["Couleur de l’indicateur"],"Purple":["Violet"],"WordPress Blue":["Bleu WordPress"],"Medium Blue":["Bleu moyen"],"Green":["Vert"],"Yellow":["Jaune"],"Orange":["Orange"],"Red":["Rouge"],"Light Grey":["Gris clair"],"Black":["Noir"],"Restrict visibility to specific individual users on your website based on user ID. You can select multiple users at once.":["Limiter la visibilité sur votre site à des comptes spécifiques en fonction de l’ID du compte. Plusieurs comptes peuvent être sélectionnés en même temps."],"Enable individual user restrictions.":["Activez les restrictions de comptes spécifiques."],"Visit the plugin Knowledge Base for more information on configuring third-party integration controls and what integrations are currently available in Block Visibility.":["Consultez la base de connaissances de l’extension pour plus d’informations sur la configuration des contrôles relatifs aux intégrations tierces et quelles intégrations sont actuellement disponibles dans Block Visibility."],"The settings below allow you to configure all third-party integration controls for Block Visibility. If you are looking for an integration, and do not see it below, make sure the respective third-party plugin is installed and activated on your website.":["Les réglages ci-dessous vous permettent de configurer tous les contrôles de visibilité des blocs pour les intégrations tierces. Si vous recherchez une intégration et que vous ne la voyez pas ci-dessous, assurez-vous que l’extension tierce correspondante est installée et activée sur votre site."],"Third-Party Integration Controls":["Contrôles des intégrations tierces"],"Restrict visibility by any user role (Administrator, Editor, Subscriber, etc.). Roles added by third-party plugins will also be available to choose from.":["Restreindre la visibilité par n’importe quel rôle (administrateur\/administratrice, éditeur\/éditrice, abonné\/abonnée, etc.). Les rôles ajoutés par des extensions tierces seront également disponibles."],"More Information":["Plus d’informations"],"Toolbar Controls":["Barre d’outils des contrôles"],"Enable contextual indicators.":["Activer les indicateurs contextuels."],"Contextual Indicators":["Indicateurs contextuels"],"Select Controls…":["Sélectionnez les contrôles…"],"Default visibility controls":["Contrôles de visibilité par défaut"],"Enable the Advanced Custom Fields control.":["Activer le contrôle Advanced Custom Fields."],"Reset":["Réinitialiser"],"Cancel":["Annuler"],"Advanced Custom Fields":["Advanced Custom Fields"],"Enable the WP Fusion control.":["Activer le contrôle WP Fusion."],"The Query String control allows you to conditionally display blocks based on URL query strings.":["Le contrôle Chaîne de requête permet d’afficher conditionnellement les blocs en fonction de chaînes de requête d’URL."],"Enable the Query String control.":["Activer le contrôle Chaîne de requête."],"WP Fusion":["WP Fusion"],"Query String":["Chaine de requête"],"Enable the User Role controls.":["Activer les contrôles de rôle du compte"],"Twitter":["Twitter"],"Knowledge Base":["Base de connaissances"],"By default, the CSS needed for the Screen Size controls is loaded on the front end of your website. If disabled, you will need to add the CSS manually to your theme for the Screen Size controls to work properly. This CSS code is available via the \"Preview Frontend CSS\" button.":["Par défaut, le CSS nécessaire aux contrôles de Taille d’écran est chargé sur l’interface publique de votre site. S’il est désactivé, vous devrez ajouter le CSS manuellement à votre thème pour que les contrôles de Taille d’écran fonctionnent correctement. Ce code CSS est disponible via le bouton « Prévisualiser le CSS de l’interface publique » sur cette page."],"Note that once enabled, any block that is only using the advanced controls to hide at extra large or extra small breakpoints will become visible again if you disable this setting in the future.":["Veuillez noter qu’une fois activé, tout bloc qui utilise uniquement les contrôles avancés pour être masqué sur les très grands ou très petits écrans redeviendra visible si ce réglage est désactivé ultérieurement."],"By default, the Screen Size control includes two breakpoints and three controls for users to hide blocks. There are certain situations where you may need more control over when a block should be visible, for example, in the case of very large or small screens. Enabling advanced controls provides these options.":["Par défaut, le contrôle Taille d’écran comprend deux points de rupture et trois contrôles permettant aux utilisatrices et utilisateurs de masquer les blocs. Il existe certaines situations où vous pouvez avoir besoin de plus de contrôles, par exemple dans le cas d’écrans très grands ou petits. L’activation des contrôles avancés fournit ces options."],"The Screen Size control allows you to conditionally display blocks on the current width of the browser window, or in other words, the screen size of a user's device.":["Le contrôle Taille d’écran permet d’afficher conditionnellement les blocs en fonction de la largeur actuelle de la fenêtre du navigateur, ou en d’autres termes, la taille d’écran de l’appareil d’un internaute."],"Enable the Screen Size controls.":["Activer les contrôles de taille d’écran."],"Screen Size":["Taille d’écran"],"Load screen size CSS on the frontend of this website.":["Charger la taille d’écran définie dans le CSS de l’interface publique de ce site."],"Enable advanced screen size controls.":["Activer les contrôles avancés de taille d’écran."],"Allows users to hide blocks on extra small screen sizes, less than %s.":["Permet de masquer des blocs sur les tailles d’écran très petites, inférieures à %s."],"Enable mobile (portrait) control":["Activer le contrôle sur mobile (portrait)"],"Allows users to hide blocks on small screen sizes, between %1$s and %2$s.":["Permet de masquer les blocs sur les petites tailles d’écran, entre %1$s et %2$s."],"Allows users to hide blocks on small screen sizes, less than %s.":["Permet de masquer les blocs sur les petites tailles d’écran, inférieures à %s."],"Enable mobile (landscape) control":["Activer le contrôle sur mobile (paysage)"],"Enable mobile control":["Activer le contrôle sur mobile"],"Allows users to hide blocks on medium screen sizes, between %1$s and %2$s.":["Permet de masquer les blocs sur les tailles d’écran moyennes, entre %1$s et %2$s."],"Enable tablet control":["Activer le contrôle sur tablette"],"Allows users to hide blocks on large screen sizes, between %1$s and %2$s.":["Permet de masquer les blocs sur les grandes tailles d’écran, entre %1$s et %2$s."],"Allows users to hide blocks on large screen sizes, %s and up.":["Permet de masquer les blocs sur les grandes tailles d’écran, supérieures ou égales à %s."],"Enable desktop control":["Activer le contrôle sur ordinateur"],"Allows users to hide blocks on extra large screen sizes, %s and up.":["Permet de masquer les blocs sur les très grandes tailles d’écran, supérieures ou égales à %s."],"Enable large desktop control":["Activer le contrôle sur grand écran"],"The default controls are Desktop, Tablet, and Mobile. Advanced screen size controls add Large Desktop and Mobile (portrait).":["Les contrôles par défaut sont Ordinateur, Tablette et Mobile. Les commandes avancées de taille d’écran ajoutent Grand écran, et Mobile (portrait)."],"The settings below allow you to restrict which controls are available to users in the Block\/Site Editor. Disabling controls will remove the corresponding CSS from the front end of your website.":["Les réglages ci-dessous vous permettent de restreindre les contrôles disponibles pour les utilisatrices et utilisateurs dans l’éditeur de blocs et de site. La désactivation des contrôles retirera le CSS correspondant sur l’interface publique de votre site."],"Controls":["Contrôles"],"The default breakpoints are Large (992px) and Medium (768px). Advanced screen size controls add Extra Large (1200px) and Small (576px).":["Les points de rupture par défaut sont Grand (992px) et Moyen (768px). Les contrôles avancés de taille d’écran ajoutent Très grand (1200px) et Petit (576px)."],"The plugin automatically sets a series of breakpoints that enable the Screen Size control. However, for best results, you can configure the breakpoints to correspond with the media breakpoints of your current theme.":["L’extension définit une série de points de rupture qui activent automatiquement le contrôle de la taille d’écran. Cependant, pour de meilleurs résultats, vous pouvez configurer les points d’arrêt pour qu’ils correspondent aux points d’arrêt définis dans votre thème."],"Breakpoints":["Points de rupture"],"Mobile (landscape) screen sizes.":["Tailles d’écran mobile (paysage)."],"Small":["Petit"],"Tablet (portrait) screen sizes.":["Tailles d’écran tablette (portrait)."],"Medium":["Moyen"],"Desktop and tablet (landscape) screen sizes.":["Tailles d’écran ordinateur et tablette (paysage)."],"Large":["Grand"],"Large desktop screen sizes.":["Tailles de grands écrans."],"Extra Large":["Très grand"],"Hide Preview":["Masquer l’aperçu"],"Preview Frontend CSS":["Prévisualiser le CSS de l’interface publique"],"Enable individual user role restrictions (Administrator, Editor, Subscriber, etc.)":["Activer les restrictions de rôles spécifiques (administrateur\/administratrice, éditeur\/éditrice, abonné\/abonnée, etc.)"],"Enable the Date & Time controls.":["Activer les contrôles de date\/heure."],"Enable the Hide Block control.":["Activer le contrôle de masquage des blocs."],"GitHub":["GitHub"],"Support":["Support"],"Loading settings…":["Chargement des réglages…"],"Restrict block visibility controls to selected user roles.":["Limiter les contrôles de visibilité des blocs aux rôles sélectionnés."],"User Permissions":["Droits des comptes"],"Choose which user roles should be allowed to control visibility settings in the Editor. Administrators will always have permission.":["Choisissez les rôles qui sont autorisés à contrôler les réglages de visibilité dans l’éditeur de blocs. Les administrateurs\/administratrices auront toujours le droit."],"Block Visibility Variables":["Variables de Block Visibility"],"Block Visibility Settings":["Réglages de Block Visibility"],"Enable block toolbar controls for visibility settings.":["Activer la barre d’outils des contrôles de blocs pour les réglages de visibilité."],"Date & Time":["Date & heure"],"User Role":["Rôle du compte"],"Remove all plugin settings when Block Visibility is uninstalled.":["Supprimer tous les réglages de l’extension quand Block Visibility est désinstallée."],"Uninstall":["Désinstaller"],"Enable Full Control Mode to add visibility controls to <strong>every<\/strong> block. <a>Use with caution<\/a>.":["Activer le mode Contrôle total pour ajouter des contrôles de visibilité à <strong>chaque<\/strong> bloc. <a>À utiliser avec prudence<\/a>."],"Full Control Mode":["Mode contrôle total"],"Search for a block":["Rechercher un bloc"],"Visibility is disabled for %s block type":["La visibilité est désactivée pour le type de bloc %s","La visibilité est désactivée pour les types de bloc %s"],"Visibility is enabled for all blocks":["La visibilité est activée pour tous les blocs"],"Hide Block":["Masquer le bloc"],"The settings below allow you to configure the visibility controls that power Block Visibility. Pick and choose which controls you want to enable and how you would like them to function.":["Les réglages ci-dessous vous permettent de configurer les contrôles de visibilité de Block Visibility. Choisissez les contrôles que vous souhaitez activer et comment vous souhaitez qu’ils fonctionnent."],"Learn More":["En savoir plus"],"Saving":["Sauvegarde en cours"],"Update":["Mettre à jour"],"Updating…":["Mise à jour…"],"General Settings":["Réglages généraux"],"Block Manager":["Gestionnaire de blocs"],"Visibility Controls":["Contrôles de visibilité"],"Review":["Avis"],"Block Visibility":["Block Visibility"]}},"comment":{"reference":"build\/block-visibility-settings.js"}}